OpenFOAM-5/chapter5/propeller/system/streamLines
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

streamLines
{
    type            streamLine;

     // Output every
    writeControl    writeTime;
    writeInterval 10;

    setFormat       vtk; //gnuplot; //xmgr; //raw; //jplot;

    // Velocity field to use for tracking.
    UName U;

    // Tracked forwards (+U) or backwards (-U)
    trackForward    true;

    // Names of fields to sample. Should contain above velocity field!
    fields (p U);

    // Steps particles can travel before being removed
    lifeTime        10000;

    // Number of steps per cell (estimate). Set to 1 to disable subcycling.
    nSubCycle 5;

    // Cloud name to use
    cloudName       particleTracks;


     // Output every
    writeControl    writeTime;
    // writeInterval 10;
  
   seedSampleSet
    {
/*
        type        uniform;
        axis        x;  //distance;

        // Note: tracks slightly offset so as not to be on a face
        start       (-1.0 0 -3);
        end         ( 1.0 0 -3);
        nPoints     100;
*/
        type        circle;
/*
circle
cloud
face
midPoint
midPointAndFace
patchCloud
polyLine
triSurfaceMeshPointSet
uniform
*/
        origin	    (0 0 -1.0);
        circleAxis  (0 0 1);  //distance;
        axis        x;   
        startPoint	(-0.65 0 -1.0);
        dTheta	5;	 
  }

}


// ************************************************************************* //
